app/controllers/v1/admin_users_controller.rb

  def me
    return head(:unauthorized) unless current_user.present?
    @admin_user = AdminUser.find_by_id(admin_user_id)
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]