app/controllers/v1/battle_games_controller.rb

  def index
    @battle_games = BattleGame.all
---
SELECT "battle_games".* FROM "battle_games"

    def set_battle_game
      @battle_game = BattleGame.find(params[:id])
---
SELECT  "battle_games".* FROM "battle_games" WHERE "battle_games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]