app/controllers/v1/battles_controller.rb

   def index
    @battles = Battle.all
---
SELECT "battles".* FROM "battles"

  def fight
    fight_values = params.permit(:id, :name, :description, :call_auth_code, :user1_id, :user2_id, :pet1_id, :pet2_id, :status, :battle_game_id, :status)
    battle = Battle.new(fight_values)
    battle.original_id = params[:id]
    battle.created_by = params[:user1_id].to_i
---
INSERT INTO "battles" ("name", "call_auth_code", "original_id", "user2_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "test"], ["call_auth_code", "XYZ"], ["original_id", 239], ["user2_id", 2], ["status", "accepted"], ["created_at", 2016-09-12 02:41:06 UTC], ["updated_at", 2016-09-12 02:41:06 UTC]]

    def set_battle
      @battle = Battle.find(params[:id])
---
SELECT  "battles".* FROM "battles" WHERE "battles"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]