app/controllers/battle_games_controller.rb

  def index
    @battle_games = BattleGame.all
---
SELECT "battle_games".* FROM "battle_games"

  def create
    @battle_game = BattleGame.new(battle_game_params)

    respond_to do |format|
      @battle_game.updated_by = admin_user_id
      @battle_game.created_by = admin_user_id
---
INSERT INTO "battle_games" ("name", "description", "strength", "agility", "wit", "speed", "wisdom", "intelligence", "magic", "healing", "status", "updated_by", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_battle_game
      @battle_game = BattleGame.find(params[:id])
---
SELECT  "battle_games".* FROM "battle_games" WHERE "battle_games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]