app/controllers/battles_controller.rb

  def index
    @battles = Battle.all
---
SELECT "battles".* FROM "battles"

  def create
    @battle = Battle.new(battle_params)

    respond_to do |format|
      @battle.updated_by = admin_user_id
      @battle.created_by = admin_user_id
---
INSERT INTO "battles" ("name", "description", "pet1_id", "pet2_id", "battled_on", "winning_pet_id", "winning_user_id", "battle_game_id", "play_for_keeps", "is_tie", "winner_experience", "loser_experience", "winner_gold", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_battle
      @battle = Battle.find(params[:id])
---
SELECT  "battles".* FROM "battles" WHERE "battles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]